#pragma once
#include <Arduino.h>

// -------------------------------- Підключи файл з налаштуваннями параметрів дисплею в файлі нижче (28 Рядок)
// #include <User_Setup_Select.h>   // Розкоментуй для швидкого доступу. Потім закоментуй знову

// -------------------------------- Подвійна буферизація. Працює тільки за наявності PSRAM. Інакше буде викликано рестарт МК
#define DOUBLE_BUFFERRING

// -------------------------------- Відображати значення FPS на дисплеї
// #define SHOW_FPS

// -------------------------------- Глибина кольору зображення
#define COLOR_16BIT
// #define COLOR_8BIT
// #define COLOR_1BIT

// -------------------------------- Увімкнути підтримку створення скриншотів. Тримай закоментованим, якщо не використовується
// #define ENABLE_SCREENSHOTER